src/test/resources/org/springframework/ws/soap1_1/axis1/rpc-enc-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:rpcEnc soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://dispatch2.axis1.ws.springframework.org/">
			<param1 href="#id0" />
			<param2 href="#id1" />
		</ns1:rpcEnc>
		<multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:param-2"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns2="http://dispatch2.axis1.ws.springframework.org/p2/">
			<bd href="#id2" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id3" />
			<param3list soapenc:arrayType="ns3:param-3[3]" xsi:type="soapenc:Array" xmlns:ns3="http://dispatch2.axis1.ws.springframework.org/p3/">
				<param3list href="#id4" />
				<param3list href="#id5" />
				<param3list href="#id6" />
			</param3list>
		</multiRef>
		<multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns4:param-1"
			xmlns:ns4="http://dispatch2.axis1.ws.springframework.org/p1/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<list soapenc:arrayType="soapenc:byte[2]" xsi:type="soapenc:Array">
				<list href="#id7" />
				<list href="#id8" />
			</list>
			<number href="#id9" />
			<param2 href="#id10" />
			<param3list soapenc:arrayType="ns5:param-3[3]" xsi:type="soapenc:Array" xmlns:ns5="http://dispatch2.axis1.ws.springframework.org/p3/">
				<param3list href="#id11" />
				<param3list href="#id12" />
				<param3list href="#id13" />
			</param3list>
			<string xsi:type="soapenc:string">str (String)</string>
		</multiRef>
		<multiRef id="id2" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
		<multiRef id="id13" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns6:param-3"
			xmlns:ns6="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id4" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns7:param-3"
			xmlns:ns7="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id9" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:long"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37</multiRef>
		<multiRef id="id8" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">-102</multiRef>
		<multiRef id="id5" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns8:param-3"
			xmlns:ns8="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id11" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns9:param-3"
			xmlns:ns9="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id10" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns10:param-2"
			xmlns:ns10="http://dispatch2.axis1.ws.springframework.org/p2/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<bd href="#id14" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id3" />
			<param3list soapenc:arrayType="ns11:param-3[3]" xsi:type="soapenc:Array" xmlns:ns11="http://dispatch2.axis1.ws.springframework.org/p3/">
				<param3list href="#id15" />
				<param3list href="#id16" />
				<param3list href="#id17" />
			</param3list>
		</multiRef>
		<multiRef id="id7" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">36</multiRef>
		<multiRef id="id12" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns12:param-3"
			xmlns:ns12="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id3" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:int"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">44</multiRef>
		<multiRef id="id6" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns13:param-3"
			xmlns:ns13="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id16" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns14:param-3"
			xmlns:ns14="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id14" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal"
			xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
		<multiRef id="id17" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns15:param-3"
			xmlns:ns15="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
		<multiRef id="id15" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns16:param-3"
			xmlns:ns16="http://dispatch2.axis1.ws.springframework.org/p3/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<value xsi:type="soapenc:string">value</value>
		</multiRef>
	</soapenv:Body>
</soapenv:Envelope>